'''
气象学上规定，连续5天日平均气温在10C以下，就算进入冬季，第1天即为入冬日。日平均气温的计算方法有多种，本题中，日平均气温取当日最高 
气温和最低气温的平均值。某市2021年11月的气温数据存储在qiwen.txt文件中，每一行的数据包括日期、最高气温和最低气温，中间以空格分隔。
程序能依据qiwen.txt中的数据判断哪天为入冬日，其中③处应该填写() 
qiwen.txt
2021/11/1 16 7
2021/11/2 13 7
2021/11/3 19 8
2021/11/4 22 9
2021/11/5 19 16
2021/11/6 16 -1
2021/11/7 0 -6
2021/11/8 8 -2 
2021/11/9 10 0
2021/11/10 16 4
2021/11/11 14 0
2021/11/12 16 3
2021/11/13 17 1
2021/11/14 17 2
2021/11/15 14 0
2021/11/16 13 2
2021/11/17 18 1
2021/11/18 17 2
2021/11/19 11 2
2021/11/20 15 8
2021/11/21 11 -1
2021/11/22 5 -4 
2021/11/23 10 -2
2021/11/24 18 7
2021/11/25 16 -2
2021/11/26 13 1
2021/11/27 13 3
2021/11/28 6 -1
2021/11/29 6 -1
2021/11/30 6 -4 

A.t> =0
B.t==5
C.t==0
'''


 
n=0
date=[]     # 日期列表
Aver_Temperture=[]  # 每日平均气温列表
for line in open('python/学考题/202211/28程序填空/qiwen.txt'):
    # high-每日最高气温，low-每日最低气温
    day,high,low=line.split()
    date.append(day)
    Aver_Temperture.append((int(high)+int(low))/2) # ①
    n=n+1
t=0
for i in range(n):
    if Aver_Temperture[i]<10: # ②
        t=t+1
        if t==5:
            print(date[i-4],"号入冬了！")
            break
        else:
            t=0
if t==0: # ③
    print("本月未入冬")

