'''
下图a中的Python程序运行后，会得到图b所示的加法口诀表。

1 + 1 = 2 
1 + 2 = 3       2 + 2 = 4 
1 + 3 = 4       2 + 3 = 5       3 + 3 = 6
                图b

分析模仿图a中的Python程序，
在图c所示Python程序中的①、②处分别填写什么，可以得到图d所示的乘法口诀表


1 × 1 = 1 
1 × 2 = 2       2 × 2 = 4 
1 × 3 = 3       2 × 3 = 6       3 × 3 = 9 
1 × 4 = 4       2 × 4 = 8       3 × 4 = 12      4 × 4 = 16 
1 × 5 = 5       2 × 5 = 10      3 × 5 = 15      4 × 5 = 20      5 × 5 = 25 
                图d
                
'''
#图a
for i in range(1,4):
    for j in range(1,i+1):
        print(j, '+', i, '=', i+j,'\t',end='')
    print()

#图c
for i in range(1,6):        #①
    for j in range(1,i+1):  
        print(j, '×', i, '=', i*j,'\t',end='')  #②
    print()
